In [4]:
import pandas as pd
import numpy as np

file_data = pd.read_csv('./dataset/file_data.csv')
file_data['가격'] = [3000,2500,2000,3500,3000]
file_data

   차림표    가격
0   김밥  3000
1   라면  2500
2   어묵  2000
3   튀김  3500
4  떡볶이  3000

In [15]:
df1 = file_data.copy()
print(df1,type(df1))
df2 = pd.DataFrame({'차림표':['비빔밥','돈까스','닭강정','수육','제육덮밥'],
                   '가격':[6000,8000,6000,9000,9000]})
df2

   차림표    가격
0   김밥  3000
1   라면  2500
2   어묵  2000
3   튀김  3500
4  떡볶이  3000 <class 'pandas.core.frame.DataFrame'>

    차림표    가격
0   비빔밥  6000
1   돈까스  8000
2   닭강정  6000
3    수육  9000
4  제육덮밥  9000

In [18]:
# DataFrame 병합 -세로방향
dfc1 = pd.concat([df1,df2])
dfc1

    차림표    가격
0    김밥  3000
1    라면  2500
2    어묵  2000
3    튀김  3500
4   떡볶이  3000
0   비빔밥  6000
1   돈까스  8000
2   닭강정  6000
3    수육  9000
4  제육덮밥  9000

In [19]:
dfc2 = pd.concat([df1,df2],axis = 1)
dfc2

   차림표    가격   차림표    가격
0   김밥  3000   비빔밥  6000
1   라면  2500   돈까스  8000
2   어묵  2000   닭강정  6000
3   튀김  3500    수육  9000
4  떡볶이  3000  제육덮밥  9000

In [21]:
columns = ['메뉴1','가격1','메뉴2','가격2']
dfc2.columns =columns
dfc2

   메뉴1   가격1   메뉴2   가격2
0   김밥  3000   비빔밥  6000
1   라면  2500   돈까스  8000
2   어묵  2000   닭강정  6000
3   튀김  3500    수육  9000
4  떡볶이  3000  제육덮밥  9000

In [24]:
sr1 = dfc2['메뉴1']
sr2 = dfc2['가격2']
print(sr1,'\n')
print(sr2,'\n')

0     김밥
1     라면
2     어묵
3     튀김
4    떡볶이
Name: 메뉴1, dtype: object

0    6000
1    8000
2    6000
3    9000
4    9000
Name: 가격2, dtype: int64

In [25]:
# 시리즈 > 데이터프레임
df = pd.concat([sr1,sr2],axis = 1)
df

   메뉴1   가격2
0   김밥  6000
1   라면  8000
2   어묵  6000
3   튀김  9000
4  떡볶이  9000

In [38]:
#삭제
dfc3 = dfc2.copy()

dfc3.drop('가격1',axis = 1 , inplace = True) #원본에 반영
dfc3

   메뉴1   메뉴2   가격2
0   김밥   비빔밥  6000
1   라면   돈까스  8000
2   어묵   닭강정  6000
3   튀김    수육  9000
4  떡볶이  제육덮밥  9000

In [46]:
dfc4 = dfc3.copy()
dfc4.drop(0,axis = 0,inplace = True)
dfc4

   메뉴1   메뉴2   가격2
1   라면   돈까스  8000
2   어묵   닭강정  6000
3   튀김    수육  9000
4  떡볶이  제육덮밥  9000

In [64]:
# 인데싱을 통해 특정 컬럼, 특정 행 , 특정 값을 추출
dfc = dfc2.copy()
#컬럼
print(dfc['메뉴1'])
#행
print(dfc.loc[0])
# 값
print(dfc.iloc[1,1])

0     김밥
1     라면
2     어묵
3     튀김
4    떡볶이
Name: 메뉴1, dtype: object
메뉴1      김밥
가격1    3000
메뉴2     비빔밥
가격2    6000
Name: 0, dtype: object
2500

In [79]:
#조건에 맞는 데이터 추출 -불린 인덱싱
#dfc['가격2']>7000

dfc.loc[dfc['가격1']>2500,['메뉴1']]

   메뉴1
0   김밥
3   튀김
4  떡볶이

In [82]:
dfc.loc[5] = ['닭발',6000,'김말이',2000]
dfc

   메뉴1   가격1   메뉴2   가격2
0   김밥  3000   비빔밥  6000
1   라면  2500   돈까스  8000
2   어묵  2000   닭강정  6000
3   튀김  3500    수육  9000
4  떡볶이  3000  제육덮밥  9000
5   닭발  6000   김말이  2000

In [84]:
# 열 추가
dfc['메뉴3'] = ['콜라','사이다','환타','포도주','위스키','소주']
dfc

   메뉴1   가격1   메뉴2   가격2  메뉴3
0   김밥  3000   비빔밥  6000   콜라
1   라면  2500   돈까스  8000  사이다
2   어묵  2000   닭강정  6000   환타
3   튀김  3500    수육  9000  포도주
4  떡볶이  3000  제육덮밥  9000  위스키
5   닭발  6000   김말이  2000   소주

In [89]:
newdf = dfc1.reset_index()
newdf.drop('index',axis = 1,inplace = True)
newdf

    차림표    가격
0    김밥  3000
1    라면  2500
2    어묵  2000
3    튀김  3500
4   떡볶이  3000
5   비빔밥  6000
6   돈까스  8000
7   닭강정  6000
8    수육  9000
9  제육덮밥  9000

In [98]:
new_index = np.arange(0,10)
newdf1 = newdf.reindex(new_index)
newdf1.index = np.arange(1,11)
newdf1

     차림표    가격
1     김밥  3000
2     라면  2500
3     어묵  2000
4     튀김  3500
5    떡볶이  3000
6    비빔밥  6000
7    돈까스  8000
8    닭강정  6000
9     수육  9000
10  제육덮밥  9000

In [99]:
#내림차순 정렬
newdf2 = newdf1.sort_index(ascending = False)
newdf2

     차림표    가격
10  제육덮밥  9000
9     수육  9000
8    닭강정  6000
7    돈까스  8000
6    비빔밥  6000
5    떡볶이  3000
4     튀김  3500
3     어묵  2000
2     라면  2500
1     김밥  3000

In [100]:
newdf3 = newdf2.sort_index(ascending = True)
newdf3

     차림표    가격
1     김밥  3000
2     라면  2500
3     어묵  2000
4     튀김  3500
5    떡볶이  3000
6    비빔밥  6000
7    돈까스  8000
8    닭강정  6000
9     수육  9000
10  제육덮밥  9000

In [103]:
newdf4 = newdf2.sort_values(by=['가격'],ascending = False)
newdf4

     차림표    가격
10  제육덮밥  9000
9     수육  9000
7    돈까스  8000
8    닭강정  6000
6    비빔밥  6000
4     튀김  3500
5    떡볶이  3000
1     김밥  3000
2     라면  2500
3     어묵  2000

In [47]:
!pip install seaborn

Requirement already satisfied: seaborn in c:\users\admin\anaconda3\envs\cakd5\lib\site-packages (0.11.2)
Requirement already satisfied: pandas>=0.23 in c:\users\admin\anaconda3\envs\cakd5\lib\site-packages (from seaborn) (1.3.4)
Requirement already satisfied: scipy>=1.0 in c:\users\admin\anaconda3\envs\cakd5\lib\site-packages (from seaborn) (1.7.1)
Requirement already satisfied: numpy>=1.15 in c:\users\admin\anaconda3\envs\cakd5\lib\site-packages (from seaborn) (1.21.2)
Requirement already satisfied: matplotlib>=2.2 in c:\users\admin\anaconda3\envs\cakd5\lib\site-packages (from seaborn) (3.5.0)
Requirement already satisfied: cycler>=0.10 in c:\users\admin\anaconda3\envs\cakd5\lib\site-packages (from matplotlib>=2.2->seaborn) (0.11.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\admin\anaconda3\envs\cakd5\lib\site-packages (from matplotlib>=2.2->seaborn) (1.3.1)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\admin\anaconda3\envs\cakd5\lib\site-packages (from matplotlib>=2.2->seaborn) (2.8.2)
Requirement already satisfied: pillow>=6.2.0 in c:\users\admin\anaconda3\envs\cakd5\lib\site-packages (from matplotlib>=2.2->seaborn) (8.4.0)
Requirement already satisfied: pyparsing>=2.2.1 in c:\users\admin\anaconda3\envs\cakd5\lib\site-packages (from matplotlib>=2.2->seaborn) (3.0.4)
Requirement already satisfied: packaging>=20.0 in c:\users\admin\anaconda3\envs\cakd5\lib\site-packages (from matplotlib>=2.2->seaborn) (21.3)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\admin\anaconda3\envs\cakd5\lib\site-packages (from matplotlib>=2.2->seaborn) (4.25.0)
Requirement already satisfied: pytz>=2017.3 in c:\users\admin\anaconda3\envs\cakd5\lib\site-packages (from pandas>=0.23->seaborn) (2021.3)
Requirement already satisfied: six>=1.5 in c:\users\admin\anaconda3\envs\cakd5\lib\site-packages (from python-dateutil>=2.7->matplotlib>=2.2->seaborn) (1.16.0)